[
    {
      "slug": "quickwrite",
      "title": "QuickWrite",
      "summary": "QuickWrite is a social media app designed for creative writers that delivers a new prompt each day and gives the user 15 minutes to craft their response. Writers can post anonymously or under a username, explore how others approached the same challenge, and build community around daily creativity. The app combines timed writing exercises with social interaction to inspire consistent practice and collaboration.",
      "responsibilities": [
        "Contributed to frontend UI design and development using React, HTML, CSS, and JavaScript",
        "Implemented backend features with Firebase Authentication, Realtime Database, and Cloud Functions",
        "Actively participated in Agile Scrum ceremonies, sprint planning, and collaborative team development",
        "Maintained developer documentation by writing the GitHub Wiki",
        "Utilized Git/GitHub for version control, issue tracking, and project management",
        "Performed testing through Firebase Test Lab, automated unit tests, and device emulation"
      ],
      "stack": [
        "  React",
        "  HTML",
        "  CSS",
        "  JavaScript",
        "  Node.js",
        "  Firebase (Authentication, Realtime Database, Cloud Functions, Test Lab)",
        "  NoSQL"
      ],
      "heroImage": "images/projects/quickwrite/hero.png",
      "gallery": [
        "images/projects/quickwrite/SS1.jpg",
        "images/projects/quickwrite/SS2.jpg",
        "images/projects/quickwrite/SS3.png",
        "images/projects/quickwrite/SS4.png",
        "images/projects/quickwrite/SS5.jpg",
        "images/projects/quickwrite/SS6.jpg"
      ],
      "links": {
        "repo": "https://github.com/WParkerHolland/CSC305",
        "wiki": "https://github.com/WParkerHolland/CSC305/wiki",
        "board": "https://github.com/users/WParkerHolland/projects/2",
        "site": "https://wparkerholland.github.io/CSC305/"
      }
    },
    {
        "slug": "carroll-custom-tackle",
        "title": "Carroll Custom Tackle LLC",
        "summary": "In July of 2025, a close friend and I co-founded Carroll Custom Tackle LLC, a company dedicated to designing and selling custom fishing lures. I originally built our website by hardcoding it from scratch with HTML, CSS, and JavaScript to establish an online presence. While the initial website was on a good track, we quickly realized that maintaining and scaling it as our business grew would demand more time than we could reasonably commit. To streamline operations, we migrated the site to Squarespace, which provided built-in e-commerce tools, responsive templates, and secure payment integrations. This allowed us to focus our energy on product development and business growth, while still maintaining a professional online storefront.",
        "stack": ["HTML", "CSS", "JavaScript", "Stripe"],
        "heroImage": "images/projects/cct/hero.png",
        "responsibilities": [
            "Manage Carroll Custom Tackle LLC with my business partner, overseeing all aspects of operations",
            "Developed and launched the initial website using HTML, CSS, and JavaScript",
            "Led migration to Squarespace to improve scalability and streamline e-commerce operations",
            "Configured backend settings in Squarespace, including product catalog management, payment integrations, and order processing",
            "Oversaw branding, marketing strategy, and customer outreach to build the company’s online presence (Instagram and YouTube)",
            "Balanced business leadership with technical responsibilities to support company growth"
        ],
        "gallery": [
          "images/projects/cct/SS1.PNG",
          "images/projects/cct/SS2.PNG",
          "images/projects/cct/SS3.PNG"
        ],
        "links": {
          "repo": "https://github.com/matthewcarroll2020/CarrollCustomTackle",
          "site": "https://www.carrollcustomtackle.com/",
          "live": "https://matthewcarroll2020.github.io/CarrollCustomTackle/"
        }
    },
    {
      "slug": "legacy-js-samples",
      "title": "Foundations Portfolio",
      "summary": "A simple, public-facing site that introduces my work and links to JavaScript projects that I have created. The site contains links to each interactable Javascript game along with an About Me page.",
      "responsibilities": [
        "Designed and developed a static website using HTML, CSS, and JavaScript",
        "Deployed the site with GitHub Pages for simple and reliable hosting",
        "Created and structured an 'About Me' page and JavaScript demo section",
        "Maintained version control and updates using Git and GitHub"
      ],
      "stack": ["HTML", "CSS", "JavaScript"],
      "heroImage": "images/projects/legacy/hero.png",
      "gallery": [
        "images/projects/legacy/SS1.PNG",
        "images/projects/legacy/SS2.PNG",
        "images/projects/legacy/SS3.PNG"
      ],
      "links": {
        "site": "https://matthewcarroll2020.github.io",
        "repo": "https://github.com/matthewcarroll2020/matthewcarroll2020.github.io"
      }
    }
]
  